# Homebrew Taps
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"

# Command Line Tools (Alphabetically ordered)
brew "awscli"            # AWS Command Line Interface
brew "bitwarden-cli"     # Bitwarden command line interface
brew "gh"                # GitHub CLI
brew "git"               # Git version control
brew "http-server"       # Simple http server
brew "jq"                # JSON processing
brew "python@3.11"       # Python programming language
brew "starship"          # Shell prompt
brew "terraform"         # Infrastructure as code tool
brew "terraform-docs"    # Documentation generator for Terraform
brew "tflint"            # Terraform linter
brew "tfsec"             # Terraform security scanner
brew "volta"             # JavaScript tool manager
brew "wget"              # Network downloader

# Desktop Applications (Casks)
cask "discord"           # Messaging app
cask "docker"            # Container platform
cask "firefox"           # Web browser
cask "google-chrome"     # Web browser
cask "slack"             # Messaging app for teams
cask "spotify"           # Music streaming service
cask "visual-studio-code"# Code editor

# Mac App Store Applications
mas "Bitwarden", id: 1352778147  # Password manager

# Visual Studio Code Extensions
vscode "GitHub.copilot"                  # AI pair programmer
vscode "github.vscode-github-actions"    # GitHub Actions integration
vscode "GitHub.vscode-pull-request-github" # GitHub pull request integration
vscode "dbaeumer.vscode-eslint"                # ESLint integration
vscode "eamodio.gitlens"                       # GitLens for enhanced Git capabilities
vscode "eseom.nunjucks-template"               # Nunjucks template support
vscode "jamiemaguire.pie-design-system-vscode-prototype" # PIE Design System Prototype
vscode "ms-playwright.playwright"              # Playwright integration
vscode "unem.lit-plugin"                       # Lit plugin for web components
vscode "yoavbls.pretty-ts-errors"              # Pretty TypeScript errors